In [1]:
# Import dependencies
import sqlite3
import pandas as pd
import numpy as np
from numpy import nan

In [2]:
# Connect to database
conn = sqlite3.connect('..\\database.sqlite')

In [3]:
# Read sqlite query results into a pandas DataFrame
coordinate_df = pd.read_sql_query('SELECT * from coordinate_table',conn)
coordinate_df.head()

   index abbreviation   Latitude   Longitude       state
0      0           AL  32.601011  -86.680736     Alabama
1      1           AK  61.302501 -158.775020      Alaska
2      2           AZ  34.168219 -111.930907     Arizona
3      3           AR  34.751928  -92.131378    Arkansas
4      4           CA  37.271875 -119.270415  California

In [4]:
# Read sqlite query results into a pandas DataFrame
div_df  = pd.read_sql_query('SELECT * from nielsen_division_table',conn)
div_df.head()

   index       state    division
0      0     Alabama  south_east
1      1      Alaska     pacific
2      2     Arizona    mountain
3      3    Arkansas  south_west
4      4  California     pacific

# Get Center Coordinate of Each Division

In [5]:
# Read sqlite query results into a pandas DataFrame
nielsen_div_coordinate  = pd.read_sql_query("""
SELECT 'east_central' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'east_central'

union

SELECT 'north_east' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'north_east'

union

SELECT 'pacific' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'pacific'

union

SELECT 'south' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'south'

union

SELECT 'south_east' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'south_east'

union

SELECT 'south_west' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'south_west'

union

SELECT 'west_central' as division,

avg(Latitude) as Latitude,
avg(Longitude) as Longitude

FROM coordinate_table a
inner join nielsen_division_table b
on a.state = b.state

where division = 'west_central'

""",conn)

nielsen_div_coordinate

       division   Latitude   Longitude
0  east_central  41.885151  -86.971436
1    north_east  42.233242  -72.815566
2       pacific  40.415126 -126.620620
3         south  35.918664  -79.692964
4    south_east  34.709733  -87.076199
5    south_west  33.051101  -95.588672
6  west_central  42.623574  -96.820403

In [6]:
# Save data frame to csv
nielsen_div_coordinate.to_csv('../clean_data/nielsen_div_coordinate.csv')